# AsInteger Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..AsInteger Method
IFCData Class See Also
---
Gets storage value as integer when its PrimitiveType is integer.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int AsInteger()
```

Visual Basic
---
```text
Public Function AsInteger As Integer
```

Visual C++
---
```text
public:
int AsInteger()
```

# ### Return Value
The int value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | The primitive type is not integer. |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace